In [11]:
import pandas as pd
Data = {
    "name":["Rupesh kumar","rishi kumar","mahesh"],
    "age": [21,22,50],
    "marks":[100,100,100],
    "salary":[10000000,1000000,200000]
}

df=pd.DataFrame(Data)
df

           name  age  marks    salary
0  Rupesh kumar   21    100  10000000
1   rishi kumar   22    100   1000000
2        mahesh   50    100    200000

In [12]:
df.describe()

             age  marks        salary
count   3.000000    3.0  3.000000e+00
mean   31.000000  100.0  3.733333e+06
std    16.462078    0.0  5.441813e+06
min    21.000000  100.0  2.000000e+05
25%    21.500000  100.0  6.000000e+05
50%    22.000000  100.0  1.000000e+06
75%    36.000000  100.0  5.500000e+06
max    50.000000  100.0  1.000000e+07

In [13]:
df[df["age"]<35]

           name  age  marks    salary
0  Rupesh kumar   21    100  10000000
1   rishi kumar   22    100   1000000

In [14]:
df["salary after tax"]=df["salary"]*0.9
df

           name  age  marks    salary  salary after tax
0  Rupesh kumar   21    100  10000000         9000000.0
1   rishi kumar   22    100   1000000          900000.0
2        mahesh   50    100    200000          180000.0